// 4. Տրված է ամբողջ թվերի հաջորդականություն: Արտածել այդ հաջորդականության  
// ա) առաջին միանիշ տարրը,  
// բ) 5-ին պատիկ վերջին տարրը,  
// գ) վերջին երկնիշ տարրը և դրան հաջորդող կենտ տարրերի քանակը,  
// դ) առաջին զույգ տարրը և դրան նախորդող տարրերի գումարը, 
//  ե) 7-ից մեծ վերջին տարրը և դրան նախորդող զույգ տարրերի արտադրյալը,  
// զ) մինչև առաջին բացասական տարրը եղած այն տարրերի քանակը, որոնք պատկանում են [0,20] միջակայքին,  
// է) [5,24] միջակայքում գտնվող առաջին տարրը և դրան հաջորդող տարրերի միջին թվաբանականը, 
//  ը) առաջին 0-ին հաջորդող 1-ով սկսվող թվերի գումարը (եթե հաջորդականությունը 0 չի պարունակում՝ արտածել -1):

// ա) առաջին միանիշ տարրը,  

// let arr = [12,30,-4,2]

// for(let i = 0; i < arr.length; i++){
//     if(arr[i] < 9 && arr[i] > -9){
//     console.log(arr[i])
//     break;
//     }
// }

// բ) 5-ին պատիկ վերջին տարրը,  



